aplikasi/app/Controllers/Dashboard.php

    public function cek()
    {
        $peserta = $this->pesertaModel->where('nisn', $this->request->getVar('keyword'))->first();
---
SELECT *
FROM `tb_peserta`
WHERE `nisn` = '11111'
 LIMIT 1