aplikasi/app/Controllers/Admin/Auth.php

SELECT *
FROM `tb_admin`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $admins = $this->adminModel;
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $dataadmin = $admins->where(['email' => $email])->first();