aplikasi/app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `tb_peserta`
SELECT COUNT(*) AS `numrows` FROM `tb_admin`
SELECT COUNT(*) AS `numrows`
FROM `tb_peserta`
WHERE `status` = 3
SELECT COUNT(*) AS `numrows`
FROM `tb_peserta`
WHERE `status` = 4
---
    public function index()
    {
        $peserta = $this->pesertaModel->countAll();
        $admin = $this->adminModel->countAll();
        $diterima = $this->pesertaModel->where(['status' => 3])->countAllResults();
        $ditolak = $this->pesertaModel->where(['status' => 4])->countAllResults();