aplikasi/app/Controllers/Admin/Peserta.php

SELECT *
FROM `tb_peserta`
WHERE `status` = 3 OR `status` = 4
---
    public function index()
    {
        $peserta = $this->pesertaModel->where("status=3 OR status=4")->findAll();

SELECT *
FROM `tb_peserta`
WHERE `status` = 1
---
    public function pesertabaru()
    {
        $peserta = $this->pesertaModel->where(['status' => 1])->findAll();